ecsistem/oled-esp8266/src/wifi_portal.cpp
#include "wifi_portal.h"

#include <ArduinoJson.h>
#include <DNSServer.h>
#include <ESP8266HTTPClient.h>
#include <ESP8266WiFi.h>
#include <LittleFS.h>
#include <WiFiUdp.h>
#include <time.h>

#include "app_state.h"
#include "deauther.h"
#include "wifi_scan.h"

namespace
{
  constexpr byte DNS_PORT = 53;
  constexpr const char *capturedCredentialsPath = "/captured_credentials.json";
  DNSServer dnsServer;

  void applyCaptivePortalDnsState()
  {
    dnsServer.stop();

    if (captivePortalEnabled)
    {
      dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
    }
  }

  String escapeHtml(const String &value)
  {
    String escaped;

    for (size_t i = 0; i < value.length(); i++)
    {
      char c = value[i];

      if (c == '&')
        escaped += "&amp;";
      else if (c == '<')
        escaped += "&lt;";
      else if (c == '>')
        escaped += "&gt;";
      else if (c == '"')
        escaped += "&quot;";
      else
        escaped += c;
    }

    return escaped;
  }

  void loadWiFiConfig()
  {
    if (!LittleFS.exists(wifiConfigPath))
    {
      return;
    }

    File file = LittleFS.open(wifiConfigPath, "r");
    if (!file)
    {
      return;
    }

    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, file);
    file.close();

    if (error)
    {
      return;
    }

    wifiSsid = doc["ssid"] | wifiSsid;
    wifiPassword = doc["password"] | wifiPassword;
    apSsid = doc["ap_ssid"] | apSsid;
    apPassword = doc["ap_password"] | apPassword;
    apOpen = doc["ap_open"] | apOpen;
    weatherUpdateIntervalMs = doc["weather_interval_ms"] | weatherUpdateIntervalMs;
    screenChangeIntervalMs = doc["screen_change_ms"] | screenChangeIntervalMs;
    timezoneOffsetHours = doc["timezone_offset_hours"] | timezoneOffsetHours;
    oledBrightness = doc["oled_brightness"] | oledBrightness;
    captivePortalEnabled = doc["captive_portal_enabled"] | captivePortalEnabled;
    screen1Enabled = doc["screen1_enabled"] | screen1Enabled;
    screen2Enabled = doc["screen2_enabled"] | screen2Enabled;
    screen3Enabled = doc["screen3_enabled"] | screen3Enabled;
    screen4Enabled = doc["screen4_enabled"] | screen4Enabled;
    screen5Enabled = doc["screen5_enabled"] | screen5Enabled;
    deautherApMac = doc["deauther_ap_mac"] | deautherApMac;
    deautherClientMac = doc["deauther_client_mac"] | deautherClientMac;
    deautherChannel = doc["deauther_channel"] | deautherChannel;
    deautherDeauthAll = doc["deauther_deauth_all"] | deautherDeauthAll;
    deautherDeauthsPerTarget = doc["deauther_deauths_per_target"] | deautherDeauthsPerTarget;
    deautherDeauthReason = doc["deauther_deauth_reason"] | deautherDeauthReason;
    deautherBeaconInterval100ms = doc["deauther_beacon_interval_100ms"] | deautherBeaconInterval100ms;
    deautherProbeFramesPerSsid = doc["deauther_probe_frames_per_ssid"] | deautherProbeFramesPerSsid;
  }

  bool saveWiFiConfig()
  {
    JsonDocument doc;
    doc["ssid"] = wifiSsid;
    doc["password"] = wifiPassword;
    doc["ap_ssid"] = apSsid;
    doc["ap_password"] = apPassword;
    doc["ap_open"] = apOpen;
    doc["weather_interval_ms"] = weatherUpdateIntervalMs;
    doc["screen_change_ms"] = screenChangeIntervalMs;
    doc["timezone_offset_hours"] = timezoneOffsetHours;
    doc["oled_brightness"] = oledBrightness;
    doc["captive_portal_enabled"] = captivePortalEnabled;
    doc["screen1_enabled"] = screen1Enabled;
    doc["screen2_enabled"] = screen2Enabled;
    doc["screen3_enabled"] = screen3Enabled;
    doc["screen4_enabled"] = screen4Enabled;
    doc["screen5_enabled"] = screen5Enabled;
    doc["deauther_ap_mac"] = deautherApMac;
    doc["deauther_client_mac"] = deautherClientMac;
    doc["deauther_channel"] = deautherChannel;
    doc["deauther_deauth_all"] = deautherDeauthAll;
    doc["deauther_deauths_per_target"] = deautherDeauthsPerTarget;
    doc["deauther_deauth_reason"] = deautherDeauthReason;
    doc["deauther_beacon_interval_100ms"] = deautherBeaconInterval100ms;
    doc["deauther_probe_frames_per_ssid"] = deautherProbeFramesPerSsid;

    File file = LittleFS.open(wifiConfigPath, "w");
    if (!file)
    {
      return false;
    }

    bool ok = serializeJson(doc, file) > 0;
    file.close();
    return ok;
  }

  unsigned long parseULongBounded(const String &raw, unsigned long minValue, unsigned long maxValue, unsigned long fallback)
  {
    if (raw.length() == 0)
    {
      return fallback;
    }

    unsigned long value = strtoul(raw.c_str(), nullptr, 10);
    if (value < minValue)
      return minValue;
    if (value > maxValue)
      return maxValue;
    return value;
  }

  int parseIntBounded(const String &raw, int minValue, int maxValue, int fallback)
  {
    if (raw.length() == 0)
    {
      return fallback;
    }

    long value = strtol(raw.c_str(), nullptr, 10);
    if (value < minValue)
      return minValue;
    if (value > maxValue)
      return maxValue;
    return static_cast<int>(value);
  }

  void applyDisplayAndTimeSettings()
  {
    display.ssd1306_command(SSD1306_SETCONTRAST);
    display.ssd1306_command(oledBrightness);
    configTime(timezoneOffsetHours * 3600, 0, "pool.ntp.org");
  }

  void connectStationWiFi()
  {
    lastConnectAttemptAt = millis();
    WiFi.begin(wifiSsid.c_str(), wifiPassword.c_str());

    unsigned long startedAt = millis();

    while (WiFi.status() != WL_CONNECTED && millis() - startedAt < 15000)
    {
      delay(300);
    }
  }

  String wifiStatusToText(wl_status_t status)
  {
    if (status == WL_CONNECTED)
      return "Conectado";
    if (status == WL_NO_SSID_AVAIL)
      return "SSID nao encontrado";
    if (status == WL_CONNECT_FAILED)
      return "Falha de autenticacao";
    if (status == WL_CONNECTION_LOST)
      return "Conexao perdida";
    if (status == WL_IDLE_STATUS)
      return "Conectando";
    if (status == WL_DISCONNECTED)
      return "Desconectado";
    return "Status desconhecido";
  }

  void startHotspot()
  {
    if (apSsid.length() == 0)
    {
      apSsid = "OLED-" + String(ESP.getChipId(), HEX);
    }

    WiFi.softAPdisconnect(true);
    delay(100);

    bool apStarted = false;

